[
	{
		"channel_name":"WinningCheckers",
		"video_number":1,
		"video_title":"Live Checkers game 1. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":11,
		"length_seconds":47,
		"views":111,
		"release_date":"2020-04-08",
		"comments":2,
		"likes":4,
		"dislikes":0,
		"description":"I make a mistake and lose a checker, but still manage to win. See how! Please like, comment, subscribe and share.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":2,
		"video_title":"Live Checkers game 1. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":12,
		"length_seconds":48,
		"views":112,
		"release_date":"2020-04-09",
		"comments":3,
		"likes":5,
		"dislikes":0,
		"description":"I make a mistake and lose a checker, but still manage to win. See how! Please like, comment, subscribe and share.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":3,
		"video_title":"Live Checkers game 3. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":14,
		"length_seconds":25,
		"views":37,
		"release_date":"2020-04-10",
		"comments":3,
		"likes":3,
		"dislikes":0,
		"description":"In this game my opponent set me up for a triple jump, but I still won! Please like, comment, subscribe and share.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":4,
		"video_title":"Live Checkers game 4. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":14,
		"length_seconds":43,
		"views":36,
		"release_date":"2020-04-11",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"Today was a tough game. I played against Paped. He is a very good player and sometimes I lose to him, but this time I was determined that he wouldn't win. Games between 2 good players normally end in a draw. He actually pulled all of my checkers from my back row! but I still managed to win. Watch my video to see how. Click on the subscribe button to see more videos or go to www.winningcheckers.com.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":5,
		"video_title":"Live Checkers game 5. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":14,
		"length_seconds":43,
		"views":36,
		"release_date":"2020-04-11",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"Today was a tough game. I played against Paped. He is a very good player and sometimes I lose to him, but this time I was determined that he wouldn't win. Games between 2 good players normally end in a draw. He actually pulled all of my checkers from my back row! but I still managed to win. Watch my video to see how. Click on the subscribe button to see more videos or go to www.winningcheckers.com.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":6,
		"video_title":"Live Checkers game 5. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":10,
		"length_seconds":51,
		"views":28,
		"release_date":"2020-04-12",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"Today I lost to a very good player. He pulled my checkers from my back row and played an excellent game. See how he beat me. Please like and subscribe to see more videos on how to improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":7,
		"video_title":"Live Checkers game 6. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":9,
		"length_seconds":11,
		"views":32,
		"release_date":"2020-04-13",
		"comments":0,
		"likes":3,
		"dislikes":0,
		"description":"Today my opponent's first move was the weakest opening. See how to win a quick game by pinning his checker and form an elbow. Please like and subscribe to see more tips on how to improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":8,
		"video_title":"Live Checkers game 7. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":9,
		"length_seconds":33,
		"views":18,
		"release_date":"2020-04-14",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"In today's game, my opponent made lots of mistakes. He formed an elbow, which I took advantage of to hit him with a triple shot to get a king. See the mistakes he made so that you don't make them when you play. Please like and subscribe to see more tips to improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":9,
		"video_title":"Live Checkers game 8. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":16,
		"length_seconds":47,
		"views":29,
		"release_date":"2020-04-15",
		"comments":0,
		"likes":5,
		"dislikes":0,
		"description":"Today's live game ended in a draw. Although my opponent has only 1,431 points compared to my 5,763 he is a good player. We have a new hacker Suang Olung from the same country as Tuaran Sabah, Kadazan Duzun & Bakri89. Guess they will be battling it out for 1st. place!!!! Please like and subscribe to see more tips on how to improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":10,
		"video_title":"Live Checkers game 9. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":14,
		"length_seconds":37,
		"views":35,
		"release_date":"2020-04-16",
		"comments":0,
		"likes":3,
		"dislikes":0,
		"description":"Today 2 players didn't even make a move and were timed out. My 3rd. opponent at least played, but made several mistakes and I was able to slip by his defense to get a king first. See how I did it with a blow by blow commentary! Please like and subscribe to see new videos to improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":11,
		"video_title":"Live Checkers game 10. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":50,
		"views":8,
		"release_date":"2020-04-17",
		"comments":0,
		"likes":0,
		"dislikes":3,
		"description":"I missed a double shot early in this game, because I was concentrating on a triple shot. Watch the video to see if you can spot the double shot that I missed! Please like and subscribe to see new videos on how to improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":12,
		"video_title":"Live Checkers game 11. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":17,
		"length_seconds":35,
		"views":15,
		"release_date":"2020-04-18",
		"comments":0,
		"likes":3,
		"dislikes":0,
		"description":"Today my opponent made the classical mistake of moving his checkers from his double corner. Watch the video to see how I slipped by his defenses to get a king on his double corner and win the game! Please click the like button and subscribe for more videos that will help improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":13,
		"video_title":"Live Checkers game 12. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":17,
		"length_seconds":24,
		"views":13,
		"release_date":"2020-04-19",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"This morning it took me 6 minutes to get a game. I did have to edit that part out so that none of my viewers fell asleep watching a bobbing checker for 6 minutes! I gained a checker early on in the game, but it meant that one of my checkers was in the dog house. My opponent tried several times to take advantage of elbows that I was forced to make. Watch the video to see how I eventually won. Please click the like button and subscribe for more videos that will help improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":14,
		"video_title":"Live Checkers game 13. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":10,
		"length_seconds":0,
		"views":14,
		"release_date":"2020-04-20",
		"comments":2,
		"likes":2,
		"dislikes":0,
		"description":"My opponent used the weakest opening as white on his second move. Watch my video to see how to win easily if your opponent does this. Please click the like button and subscribe for more videos that will help improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":15,
		"video_title":"Live Checkers game 14. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":21,
		"length_seconds":1,
		"views":24,
		"release_date":"2020-04-21",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"In this video I show you how to take advantage of elbows and also use a simple point system to determine whether you are going to win the game! Please watch to discover how. Please click the like button and subscribe for more videos that will help improve your game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":16,
		"video_title":"Live Checkers game 15. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":11,
		"length_seconds":29,
		"views":12,
		"release_date":"2020-04-22",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"My 1st. opponent didn't even make a move although he had 1,537 points and had some experience playing checkers and was timed out. My 2nd. one was new to this site, but at least he played. He tried to set me up for a triple shot, but I saw it and blocked it. I also managed to pull all his checkers from his back row almost guaranteeing me the win. Watch the video to see how to win easily when you have pulled all your opponents' checkers from their back row.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":17,
		"video_title":"Live Checkers game 16. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":33,
		"length_seconds":51,
		"views":18,
		"release_date":"2020-04-23",
		"comments":3,
		"likes":2,
		"dislikes":0,
		"description":"I thought I would win easily against my opponent, because I had the better position, although we had the same amount of checkers. He had no back checkers and I had 2 kings against his 1 king and I had my anchor checkers in place. However, he still managed to get a draw. Watch the video to see how he did it! Please click on the like button and subscribe.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":18,
		"video_title":"Live Checkers game 17. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":15,
		"length_seconds":29,
		"views":13,
		"release_date":"2020-04-24",
		"comments":0,
		"likes":3,
		"dislikes":0,
		"description":"My opponent jumped the wrong way, when he had a choice of which way to jump & lost a checker. Watch the video to see what he should have done to avoid the mistake. Please click on like and hit the subscribe button for more videos.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":19,
		"video_title":"Live Checkers game 18. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":17,
		"length_seconds":12,
		"views":12,
		"release_date":"2020-04-25",
		"comments":2,
		"likes":2,
		"dislikes":0,
		"description":"Today I played against a player that had 2,114 points. I really wanted to win this game, because most of my opponents have between 1,000 to 1,500 points. I used one of my most important strategy, which is Stop, Look, Listen & then Move that improves your chances of winning by 20%. Watch the video to see how I won. Please click the like button and subscribe for more videos.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":20,
		"video_title":"Live Checkers game 19. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":20,
		"length_seconds":53,
		"views":18,
		"release_date":"2020-04-26",
		"comments":0,
		"likes":3,
		"dislikes":0,
		"description":"I got to play an opponent that had 3,305 points & won. It shows that using my 13 strategies to win 90% of the time really works! & not not just against a beginner or intermediate player. Watch the live stream video with real time commentary to see how I did it. Please click the like button & subscribe to see more videos. NB. The 1st couple of minutes of the video shows my 1st opponent who did not move at all & was timed out. So please continue to watch until you get to my more advanced opponent. Enjoy!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":21,
		"video_title":"Live Checkers game 20. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":31,
		"views":18,
		"release_date":"2020-04-27",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"I thought I had lost, because my opponent had a better position & got a king first plus he had 3 of his back checkers still in place. I manage to pull off the win by breaking up his back checkers & get a king myself. Watch the video to see how I did it. Please click the like button & subscribe for more videos.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":22,
		"video_title":"Live Checkers game 21. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":12,
		"length_seconds":36,
		"views":12,
		"release_date":"2020-04-28",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"In today's live streaming game I lost, because I changed my game play to attack my opponent's single corner. I should have followed my normal strategy, but I didn't. Watch the video to see how I lost & comment to make any suggestions on what I should have done differently. Please click the like button & subscribe to support my channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":23,
		"video_title":"Live Checkers game 22. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":8,
		"length_seconds":44,
		"views":10,
		"release_date":"2020-04-29",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"My opponent today was inexperienced and gave up 2 checkers early on by putting 2 of my checkers in both dog houses. She even fell for a 2 & 3 shot. Watch the video to see what not to do if you want to improve your game and win more games. Please click the like button & subscribe to support my channel. Thank you.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":24,
		"video_title":"Live Checkers game 23. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":14,
		"length_seconds":6,
		"views":9,
		"release_date":"2020-04-30",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"Today my opponent lost a checker after 5 moves. I was then able to slip by his defenses & get a king & win the game. Watch the video to see the importance of keeping your anchor checkers in place. Please click the like button & subscribe to support this channel. Thank you.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":25,
		"video_title":"Live Checkers game 24. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":9,
		"views":20,
		"release_date":"2020-05-02",
		"comments":0,
		"likes":3,
		"dislikes":0,
		"description":"My first opponent timed out in the middle of the game. I don't know why, but he wanted me to play fast. Perhaps that was the reason but you should always Stop, Look, Listen & then Move so that you don't make any mistakes. My second opponent at least played until the end game. We both had 4 checkers each, but he had moved all his checkers from his back & middle row & I still had my anchor checkers in place. He resigned as soon as he realized I was going to get a Mickey Mouse 2 shot. Watch the video to see what mistakes he made. Please click the like button & subscribe!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":26,
		"video_title":"Live Checkers game 25. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":10,
		"length_seconds":41,
		"views":20,
		"release_date":"2020-05-02",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"I had finished my live streaming & commentary for my daily checker game & in the afternoon I played some more games. I got a player with 3,390 points so I decided to record it live with live commentary to see I could win. She made an early mistake & allowed me to remove one of her checkers from her back row of her double corner. From then on it just got worse for her & I managed to pull all her checkers from her back row & 3 from her middle row & I was 6 points up with 3 of my back checkers still in place. Although we both had 4 checkers each it was only a matter of time before I won as long as I played carefully & didn't fall for any traps she was setting up. Watch the video to see how I won. Please click the like button & subscribe.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":27,
		"video_title":"Live Checkers game 26. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":9,
		"length_seconds":49,
		"views":7,
		"release_date":"2020-05-03",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"Today's live streaming game with live commentary shows the importance of controlling the center. In the middle of the game, I had 3 checkers in the center & my opponent had none. This gave me the opportunity of pulling his checkers away from his back line & get a king 1st. Watch the video to see how to control the center. Please support our channel by subscribing.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":28,
		"video_title":"Live Checkers game 27. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":17,
		"length_seconds":18,
		"views":8,
		"release_date":"2020-05-04",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"My first opponent chickened out & did not even make a move & was timed out, although he had 1,770 points. My second opponent timed out during the middle of the game! You can skip the 1st. 6 minutes of the video if you did not want to watch this part. My 3rd. opponent only had 1,496 points & I thought I would get an easy win. However, he turned out to be a very good player & we drew. I tried to set up some traps, but he did not fall for them & I decided to make it a draw. As they say, if you can get a draw TAKE IT! Watch the video to find out how & why we drew. Please click the like button & subscribe to support our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":29,
		"video_title":"How WinningCheckers Works. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":0,
		"length_seconds":29,
		"views":29,
		"release_date":"2020-05-05",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"none",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":30,
		"video_title":"Live Checkers game 28. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":14,
		"length_seconds":16,
		"views":12,
		"release_date":"2020-05-05",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"In today's game I blocked my opponent from developing his single corner & he made a mistake, which allowed me to gain a checker. He then made a move that would allow him to make a double shot to get his checker back. At first I thought I couldn't stop him, but I used a move called the Pitch & Squeeze to avoid this. Watch the video to see how its done. Please click the like button & subscribe. Any comments would be welcomed.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":31,
		"video_title":"Live Checkers game 29. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":1,
		"views":18,
		"release_date":"2020-05-06",
		"comments":0,
		"likes":3,
		"dislikes":0,
		"description":"Today's daily live video shows how to get a draw when your opponent has 3 kings & you have 2. This technique only works if your opponent is not an expert in checkers, because  against an expert you will lose! Watch the video to see how I frustrated my opponent, who had over 1,600 points into accepting a draw. Please click the like button & support our channel by subscribing.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":32,
		"video_title":"Live Checkers game 30. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":16,
		"length_seconds":21,
		"views":16,
		"release_date":"2020-05-29",
		"comments":4,
		"likes":1,
		"dislikes":0,
		"description":"My 1st. opponent timed out after 2 moves!. My second opponent made an early mistake & I was able to pull all of his checkers away from his back row & get a king first. & eventually win. Watch the video to see how to pull your opponents checkers away from their back line, which almost guarantees the win. Please recommend our channel to your fellow checker enthusiasts. Thank you!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":33,
		"video_title":"Live Checkers game 31. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":10,
		"length_seconds":53,
		"views":20,
		"release_date":"2020-05-10",
		"comments":0,
		"likes":3,
		"dislikes":0,
		"description":"In today's video I show you how to be like Houdini & slip by your opponents checkers & get a king to win. watch the video to see how it's done. Please subscribe & let your fellow checkers enthusiasts know about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":34,
		"video_title":"Live Checkers game 32. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":17,
		"length_seconds":1,
		"views":41,
		"release_date":"2020-05-11",
		"comments":4,
		"likes":4,
		"dislikes":0,
		"description":"I have a request by one of my subscribers to post videos playing against more advanced players. So this one is one that I was playing during my hours that I play without recording. I managed to pull all of his checkers from his back line & get 2 kings first, but he slipped by my back line & got a king & put up a really good end game. Watch the video to see how he put up a great fight. You can see a few other advanced player games pulled out into the Advanced Series. Please subscribe & let your fellow checkers enthusiasts know about our channel, where they get real live lessons on how to win up to 90% of the time without any set positions or theory...",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":35,
		"video_title":"Live Checkers game 33. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":14,
		"length_seconds":13,
		"views":19,
		"release_date":"2020-05-12",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"Today my 1st. opponent didn't want to play & timed out. My 2nd. opponent at least put up a fight. I forced him into one of the dog houses, pinned his checker, when he moved to the weakest opening. This led him to start moving his checkers from his back row & create an elbow. I took advantage of this weakness, but I had to give up 2 checkers & allow him to get a king. But his king was in the single corner & was trapped. Watch the video to see how this happened & how I won. Please subscribe & let your fellow checker lovers know about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":36,
		"video_title":"Live Checkers game 34. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":48,
		"views":24,
		"release_date":"2020-05-16",
		"comments":6,
		"likes":3,
		"dislikes":0,
		"description":"Today my opponent used the weakest opening playing white. Watch the video to see how easy it is to win when your opponent does that. Please subscribe & tell your friends & checker clubs about our channel, so that they can improve their game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":37,
		"video_title":"Live Checkers game 35. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":48,
		"views":24,
		"release_date":"2020-05-16",
		"comments":6,
		"likes":3,
		"dislikes":0,
		"description":"In today's game I played a ranked player with 4,810 points in 13th. position. I enticed him to take a double shot to move his back checkers away from his back line, because he had blocked me from getting to my sweet spot, but he had a checker in his sweet spot attacking my double corner. I got my checker back & it forced him to exchange & move a 3rd checker away from his back line. It was going to be a draw, but he made a mistake, which allowed me to capture a hanging checker to be one checker up & eventually win the game. Watch the video to see how I won. Please don't forget to subscribe & tell your fellow checkers enthusiasts about our channel. Thank you!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":38,
		"video_title":"Live Checkers game 36. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":15,
		"length_seconds":33,
		"views":22,
		"release_date":"2020-05-19",
		"comments":0,
		"likes":0,
		"dislikes":0,
		"description":"Today's game was against a new player with little experience on how to win. He made most of the common mistakes in this game, like moving all his checkers away from his back & middle rows, not controlling the center squares, not forming lines of checkers of 3 or more etc. Watch the video to see what mistakes he made and how to avoid them. Please subscribe & recommend our channel to fellow checker enthusiast!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":39,
		"video_title":"Live Checkers game 37. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":12,
		"length_seconds":53,
		"views":18,
		"release_date":"2020-05-20",
		"comments":2,
		"likes":3,
		"dislikes":0,
		"description":"In today's live game I made a early mistake & my opponent had an opportunity to get a 3 shot, but fortunately he did not see it! & I went on to win the game. Watch the video to see if you can spot the 3 shot! Please subscribe & tell your fellow checkers enthusiasts about our channel. Thank you. Any comments or recommendations are welcomed.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":40,
		"video_title":"Live Checkers game 38. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":12,
		"length_seconds":47,
		"views":45,
		"release_date":"2020-05-22",
		"comments":6,
		"likes":4,
		"dislikes":0,
		"description":"My opponent gave away a checker early in the game, which resulted in a loss for him. Lesson of today's game, stop, look, listen & then move. In other words always make sure that you are making the best move possible every time! Watch the video to see what he did wrong. Please subscribe & tell your fellow checkers enthusiasts about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":41,
		"video_title":"Live Checkers game 39. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":10,
		"length_seconds":56,
		"views":63,
		"release_date":"2020-05-26",
		"comments":7,
		"likes":3,
		"dislikes":0,
		"description":"This is the 1st. video of a live stream with live commentary of a series of 3 games against the 6th. ranked player with 8,704 points. Watch the video to see what happens! Please subscribe & tell your fellow checkers enthusiasts about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":42,
		"video_title":"Live Checkers game 40. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":27,
		"length_seconds":3,
		"views":40,
		"release_date":"2020-05-27",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"Game 2 of a series of 3 games against the 6th ranked player. Watch the video to see this tough match up! Please subscribe & tell your fellow checker enthusiasts about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":43,
		"video_title":"Live Checkers game 41. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":40,
		"views":36,
		"release_date":"2020-05-31",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"The last & final game! Removed all his checkers from his back line & had mine intact, but I still couldn't win. Watch the video to see what happened. Please subscribe & tell your fellow checkers enthusiasts about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":44,
		"video_title":"Live Checkers game 42. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":9,
		"length_seconds":33,
		"views":41,
		"release_date":"2020-06-04",
		"comments":0,
		"likes":1,
		"dislikes":1,
		"description":"Today I played against one of my opponent that I find difficult to beat. Check out the video to see how I did! Please subscribe & tell your fellow checker enthusiasts about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":45,
		"video_title":"Live Checkers game 43. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":17,
		"length_seconds":14,
		"views":26,
		"release_date":"2020-06-10",
		"comments":0,
		"likes":0,
		"dislikes":0,
		"description":"Today I played against a tough opponent. I thought I had a very good chance of winning, because he had moved all his checkers from his back row & I had 3 in my back row. But because he is an excellent player he managed to get out of it for a draw. This video also shows how to tell whether you have the opposition or not in order to face off your opponents checkers for the win.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":46,
		"video_title":"Live Checkers game 44. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":9,
		"length_seconds":58,
		"views":23,
		"release_date":"2020-06-12",
		"comments":2,
		"likes":2,
		"dislikes":0,
		"description":"I played Daily checkers yesterday & lost! Today I had another opportunity to play him so I recorded it. He is a very good player & it should have been a draw, but he moved  too quickly & made a horrible mistake &  lost. Watch the video to see the mistake he made. Please subscribe & recommend our channel to other checker enthusiasts.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":47,
		"video_title":"Live Checkers game 45. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":8,
		"length_seconds":50,
		"views":31,
		"release_date":"2020-06-14",
		"comments":2,
		"likes":0,
		"dislikes":0,
		"description":"I had an opportunity to play DailyCheckers again and this time I was prepared to counter his play by going to my Achilles heel. I stopped him by blocking his checker & pinning another one for the win. Watch the video to see how I did it. Please subscribe & tell your friends about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":48,
		"video_title":"Live Checkers game 46. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":8,
		"length_seconds":37,
		"views":29,
		"release_date":"2020-06-16",
		"comments":0,
		"likes":0,
		"dislikes":0,
		"description":"Today I played against a player that I normally lose against. He went for my Achilles heel, but I blocked him & managed to win this time! I am getting better at defending against my one weakness. Watch the video to see how I did it. Please subscribe & tell your fellow checkers enthusiasts about our channel. These games are live streaming games with live commentary, no set moves, just solid strategy to win up to 9 out of 10 games!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":49,
		"video_title":"Live Checkers game 47. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":9,
		"length_seconds":3,
		"views":32,
		"release_date":"2020-06-18",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"In this video I show you the importance of keeping your back checkers in place as long as possible if you can. Normally, you can't but if you can it normally leads to a easy win against a good player. Watch the video to see how I did it with a blow by blow live commentary. Please subscribe and tell your friends about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":50,
		"video_title":"Live Checkers game 48. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":16,
		"length_seconds":49,
		"views":53,
		"release_date":"2020-06-20",
		"comments":2,
		"likes":1,
		"dislikes":0,
		"description":"Today I had a chance to play my arch enemy PapaWat, one of the players on this site that accuses me of cheating & hacking my points. I've played over 10,000 plus games on this site & can show how many games I've played with a screen shot. I really concentrated & was determined to beat him or at least get a draw. Watch the video to see how I did. Please subscribe & tell your friends about our channel of live streaming games with live commentary with no edits apart from emojis, arrows & circles to explain clearly what I was thinking.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":51,
		"video_title":"Live Checkers game 49. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":6,
		"length_seconds":46,
		"views":63,
		"release_date":"2020-06-25",
		"comments":2,
		"likes":0,
		"dislikes":0,
		"description":"This video shows how to defeat any player who moves his checkers to your right hand side of the board in the first couple of moves. Watch the video to see how it,s done. Please subscribe & tell your friends about our channel.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":52,
		"video_title":"Live Checkers game 50. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":10,
		"length_seconds":28,
		"views":14,
		"release_date":"2020-08-25",
		"comments":2,
		"likes":1,
		"dislikes":0,
		"description":"I played against Kikwesha with 13,410 points the 3rd. ranked player and a very good player, but he hacked his points to 1st. place on this site until Dusun Lotud out hacked him! He tried his usual trick to get a 3 shot and win the game, but I know how to avoid this. Watch the video to see how it's done and get a draw. Please hit the subscribe button for more real live games with live commentary on how I lose, win or draw.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":53,
		"video_title":"Live Checkers game 51. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":17,
		"length_seconds":6,
		"views":50,
		"release_date":"2020-08-26",
		"comments":0,
		"likes":4,
		"dislikes":0,
		"description":"I make a mistake in the end game & gave up a checker. I was about to get back my checker and possibly win the game when my finger slipped & I moved the wrong checker and gave up another one! Watch the video to see what not to do! Please hit the like button & subscribe.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":54,
		"video_title":"Live Checkers game 52. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":28,
		"length_seconds":19,
		"views":38,
		"release_date":"2020-09-01",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"My 1st. opponent was shaminafaraz77 the 2nd. ranked player on this site, but he didn't even move & was timed out. The last time we played I lost, because I misplayed & had to give up a checker. But later I was going to get it back, but my finger slipped & I lost another checkers! My second opponent was Suang lotud with -18,960, I relaxed & he could have won. See if you can discover how he could have won! My last game was going to be a draw, but my opponent made a mistake & lost. See the mistake he made & how to avoid it. Please click the like button & subscribe.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":55,
		"video_title":"Live Checkers game 53. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":9,
		"length_seconds":55,
		"views":30,
		"release_date":"2020-09-09",
		"comments":4,
		"likes":3,
		"dislikes":0,
		"description":"Today's game was against a 4,540 points player. During the end game I made a mistake and lost a checker. I had 3 kings against my opponents 3 kings & a man, but I did not give up & prepared to defend 3 kings against 4. He ended up making a very bad mistake and I won the game with a 3 shot! Watch the video to see how I did it. Please click the like button & subscribe.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":56,
		"video_title":"Live Checkers game 54. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":6,
		"length_seconds":19,
		"views":27,
		"release_date":"2020-10-09",
		"comments":0,
		"likes":0,
		"dislikes":0,
		"description":"I was 1 checker down, but I had the better position. I ended up winning after my opponent made a terrible mistake near the end game & allowed me to get a king. Watch the video to see how I won. Please subscribe!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":57,
		"video_title":"Live Checkers game 55. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":6,
		"length_seconds":19,
		"views":27,
		"release_date":"2020-09-10",
		"comments":0,
		"likes":0,
		"dislikes":0,
		"description":"I was 1 checker down, but I had the better position. I ended up winning after my opponent made a terrible mistake near the end game & allowed me to get a king. Watch the video to see how I won. Please subscribe!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":58,
		"video_title":"Live Checkers game 56. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":21,
		"length_seconds":45,
		"views":21,
		"release_date":"2020-09-15",
		"comments":6,
		"likes":0,
		"dislikes":0,
		"description":"My opponent had 4,966 points but made an early mistake & I was 2 checkers up, but he put up a great defense, got 1 checker back & it took me another 16 minutes to win the game. Watch the video to see how to win against a player with a very good end game.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":59,
		"video_title":"Live Checkers game 57. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":17,
		"views":20,
		"release_date":"2020-09-16",
		"comments":0,
		"likes":1,
		"dislikes":2,
		"description":"I play the 8th. ranked player on this site with 6,615 points. In the mid game I pitched 2 of my checkers to get a 3 shot for a fairly easy win. Watch the video to see how I did it. Please don't forget to subscribe!",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":60,
		"video_title":"Live Checkers game 58. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":7,
		"length_seconds":8,
		"views":39,
		"release_date":"2020-09-18",
		"comments":6,
		"likes":5,
		"dislikes":0,
		"description":"Played a checker player with 4,434 points & lost. He used the defense that I have the most problems with & got a 3 shot to win the game. Watch the video to see what I should have done! Please subscribe & tell your friends about this channel where the games are real & not just theory.",
		"last_updated":"2020-10-24"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":61,
		"video_title":"Live Checkers game 59. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":14,
		"length_seconds":28,
		"views":37,
		"release_date":"2020-09-21",
		"comments":4,
		"likes":6,
		"dislikes":0,
		"description":"This game illustrates the importance of still concentrating even when you are 1 checkers up & not to play fast, but to stop, look, listen & then move. My opponent had the opportunity to get a 3 shot & win the game if I moved the wrong checker in the end game. Watch the video to see how to avoid this mistake.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":62,
		"video_title":"Live Checkers game 60. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":8,
		"length_seconds":21,
		"views":33,
		"release_date":"2020-09-25",
		"comments":8,
		"likes":4,
		"dislikes":0,
		"description":"I play the same opponent in game 59. He used the same response, but altered it in the mid game. I still manage to win. Watch the video to see how to win.",
		"last_updated":"2020-10-24"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":63,
		"video_title":"Live Checkers game 34. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":13,
		"length_seconds":48,
		"views":16,
		"release_date":"2020-09-27",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"My opponent had the opportunity to hit me with a 3 shot, but missed it. Watch the video to see where he went wrong. Please click the like button and subscribe!",
		"last_updated":"2020-10-24"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":64,
		"video_title":"Live Checkers game 61. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":18,
		"length_seconds":13,
		"views":45,
		"release_date":"2020-09-27",
		"comments":0,
		"likes":5,
		"dislikes":0,
		"description":"At first I didn't realize I was playing against a player that is ranked #4 on this checker site, That is why the recording didn't start at the very beginning. I was determined to really concentrate to beat him, because in our previous matches I was nervous & lost a couple of games, which should have been draws. I at one point near the end game I thought he could get another draw, but on after game analysis discovered he could not. Watch the video to see how I used my 13 strategies to win!",
		"last_updated":"2020-10-24"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":65,
		"video_title":"Live Checkers game 62. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":9,
		"length_seconds":25,
		"views":16,
		"release_date":"2020-09-29",
		"comments":0,
		"likes":1,
		"dislikes":0,
		"description":"Lost to a player with 4,780 points. He managed to keep all his 4 back checkers in place, while I had none. Will analyze this game later to find out where I went wrong. Please click the like button & subscribe for more videos.",
		"last_updated":"2020-10-24"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":66,
		"video_title":"Live Checkers game 63. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":10,
		"length_seconds":43,
		"views":39,
		"release_date":"2020-10-01",
		"comments":8,
		"likes":6,
		"dislikes":0,
		"description":"I play the 8th. ranked player on this site and he used the moves that I have trouble beating(my Achilles heal!). But I tried different moves and actually tricked him into a gambit, where I allowed him to squeeze one of my checkers, made a waiting move, and then squeezed one of his checkers near his double corner to get a king & win the game. Watch to video to see how I did it.",
		"last_updated":"2020-10-24"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":67,
		"video_title":"Live Checkers game 64. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":5,
		"length_seconds":55,
		"views":34,
		"release_date":"2020-10-05",
		"comments":2,
		"likes":4,
		"dislikes":0,
		"description":"I play against my nemesis Kikwesha with 14,499 points. It was a fairly easy win with him timing out after 5 minutes into the game, because he knew I had the better position and he would eventually lose. Watch the video to see how I did it.",
		"last_updated":"2020-10-24"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":68,
		"video_title":"Live Checkers game 65. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":7,
		"length_seconds":4,
		"views":30,
		"release_date":"2020-10-07",
		"comments":0,
		"likes":2,
		"dislikes":0,
		"description":"Today my opponent was the 7th. ranked player with 9,807 points. I used to play him lot a couple of months ago and beat him on a regular basis, when he was coming up the ranks. But suddenly he increased his points rapidly to get into 7th. position. I suspect that he is hacking his points. He made the mistake of moving his checkers out from his double corner and eventually all his checkers from his back row, which led to a fairly easy win for me. Watch the video to see how I did it.",
		"last_updated":"2020-10-20"
	},
		{
		"channel_name":"WinningCheckers",
		"video_number":69,
		"video_title":"Live Checkers game 66. How to play checkers and win.",
		"length_hours":0,
		"length_minutes":22,
		"length_seconds":13,
		"views":65,
		"release_date":"2020-10-11",
		"comments":10,
		"likes":5,
		"dislikes":0,
		"description":"I got a request to record a live checkers game with live commentary from one of my subscribers, so that he can learn what mistakes he is making. Recently, I have not been recording games with players with less than 5,000 points, but he thought it would be a good idea for beginning players so I went along with it. He is actually a good player, because we drew 1 of our many games. I make a early mistake and was going to lose one of my checkers by being squeezed, but I manage to win the game eventually, by using a gambit. I sacrificed the doomed checker so that I can get a king in his double corner and because I had my anchor checkers still intact I had a good chance of getting a draw or possibly a win. Watch the video to see how I did it. Please subcribe and click the notification button.",
		"last_updated":"2020-10-24"
	},
    {
		"channel_name":"",
		"video_number":70,
		"video_title":"Live Checkers game 67. How to play checkers and win.  I play the 1st. rank player with 30,133 points.",
		"length_hours":0,
		"length_minutes":15,
		"length_seconds":8,
		"views":24,
		"release_date":"2020-10-21",
		"comments":1,
		"likes":3,
		"dislikes":0,
		"description":"Watch the video to see what happens!",
		"last_updated":"2020-10-24"
	}
]